xhoming/balance-car-k210-stm32/my_balance/APP/app_vision_turn.h
#ifndef __APP_VISION_TURN_H_
#define __APP_VISION_TURN_H_

#include "stm32f1xx_hal.h"

#define VISION_FRAME_HEAD 0xA5
#define VISION_FRAME_TAIL 0x5A
#define VISION_MIN_CONFIDENCE 15

typedef struct
{
    int16_t error;          /* road center error: -100..100 */
    int16_t slope;          /* road heading trend: -100..100 */
    uint8_t confidence;
    uint8_t base_speed;
    uint32_t last_update_ms;
} VisionInput_t;

extern volatile VisionInput_t g_vision_input;
extern volatile int16_t g_vision_debug_v;
extern volatile int16_t g_vision_debug_t;

extern float Vision_Heading_Kp;
extern float Vision_Crosstrack_Kp;
extern float Vision_Crosstrack_Gain;
extern float Vision_Speed_Soft;
extern float Vision_Turn_Kd;
extern float Vision_Gyro_Direction;
extern float Vision_Max_PWM;

void VisionTurn_UpdateInput(int16_t error, int16_t slope, uint8_t confidence,
                            uint8_t base_speed);
float VisionTurn_Calc(float gyro_z);
float VisionSpeed_Target(float base_speed);
void VisionTurn_Reset(void);
void VisionTurn_ParseByte(uint8_t rx);

#endif
